# concat

In [1]:
#dize değerlerini birleştirmek için kullanılır
import numpy as np
import pandas as pd

In [2]:
#önce kolonları yazmak lazım
sozluk1={"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
         "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
         "Kalori" : [100,200,300,400]
        }

In [3]:
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [4]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [5]:
sozluk2={"Isim" : ["Osman","Levent","Atlas","Fatma"],
         "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
         "Kalori" : [100,200,250,150]
        }

In [6]:
dataFrame2=pd.DataFrame(sozluk2,index=[4,5,6,7])

In [7]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     100
5  Levent      Yüzme     200
6   Atlas       Koşu     250
7   Fatma  Basketbol     150

In [8]:
sozluk3={"Isim" : ["Ayşe","Mahmut","Duygu","Nur"],
         "Spor" : ["Koşu","Yüzme","Badminton","Tenis"],
         "Kalori" : [400,500,100,200]
        }

In [9]:
dataFrame3=pd.DataFrame(sozluk3,index=[8,9,10,11])

In [10]:
dataFrame3

      Isim       Spor  Kalori
8     Ayşe       Koşu     400
9   Mahmut      Yüzme     500
10   Duygu  Badminton     100
11     Nur      Tenis     200

In [11]:
#birşeltirme
pd.concat([dataFrame1,dataFrame2,dataFrame3])

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     100
5   Levent      Yüzme     200
6    Atlas       Koşu     250
7    Fatma  Basketbol     150
8     Ayşe       Koşu     400
9   Mahmut      Yüzme     500
10   Duygu  Badminton     100
11     Nur      Tenis     200

In [12]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     100
5   Levent      Yüzme     200
6    Atlas       Koşu     250
7    Fatma  Basketbol     150
8     Ayşe       Koşu     400
9   Mahmut      Yüzme     500
10   Duygu  Badminton     100
11     Nur      Tenis     200

# merge
#iki veya daha fazla DataFrame'i birleştirmek için kullanılır

In [13]:
mergeSozluk={"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
             "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"]
            }

In [14]:
mergeDataFrame=pd.DataFrame(mergeSozluk)

In [15]:
mergeDataFrame

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [16]:
mergeSozluk2={"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
             "Kalori" : [100,200,150,250]
            }

In [17]:
mergeDataFrame2=pd.DataFrame(mergeSozluk2)

In [18]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atıl     250

In [19]:
pd.merge(mergeDataFrame,mergeDataFrame2,on="Isim")
#on: hangi kolon üzerinden işlem yapacağız isim ortak

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3    Atıl  Basketbol     250

# pandas ileri operasyonlar

In [20]:
maasSozluk={"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
            "Departman" : ["Yazılım","Satış","Pazarlama","Yazılım"],
            "Maas" : [200,300,400,500]
           }

In [21]:
maasDataFrame=pd.DataFrame(maasSozluk)

In [22]:
maasDataFrame

     Isim  Departman  Maas
0   Ahmet    Yazılım   200
1  Mehmet      Satış   300
2  Zeynep  Pazarlama   400
3    Atıl    Yazılım   500

In [23]:
#unique:tekli getir
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [24]:
maasDataFrame["Departman"].nunique() #kaç tane var

3

In [25]:
#değer sayılarını istediğinde
maasDataFrame["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [26]:
def bruttenNete(maas):
    return maas*0.66

In [27]:
maasDataFrame["Maas"].apply(bruttenNete) #apply:uygula

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [28]:
#null var mı yok mu bakabiliriz
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [29]:
#özet tablolar oluştutrmak açısından yardımcı. excellde kullanılıyor ->pivot table 
yeniBirVeri={"Karakter Sınıfı" : ["South Park","South Park","Simpson","Simpson","Simpson"],
             "Karakter İsmi" : ["Cartman","Kenny","Homer","Bart","Bart"],
             "Karakter Yas" : [9,10,50,20,10]
            }

In [30]:
karakterDF=pd.DataFrame(yeniBirVeri)

In [31]:
karakterDF

  Karakter Sınıfı Karakter İsmi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [32]:
karakterDF.pivot_table(values="Karakter Yas",index=["Karakter Sınıfı","Karakter İsmi"],aggfunc=np.sum)
#aynı karakterde olanların ortamasını alır pivot_table

                               Karakter Yas
Karakter Sınıfı Karakter İsmi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10